13 10
32 116
104 101
32 97
111 117
32 115
32 109
105 110
32 119
114 101
104 97
110 100
257 258
32 98
105 115
111 114
256 256
32 102
101 114
108 108
105 116
111 110
32 100
32 99
101 115
101 110
32 110
32 108
32 121
257 104
97 114
32 104
32 111
257 111
284 260
32 112
266 116
32 73
32 258
256 84
115 116
118 101
111 116
259 267
111 119
263 103
97 110
288 102
111 109
32 103
256 65
97 116
269 101
115 101
262 121
32 263
99 101
32 266
108 101
256 87
97 121
108 100
105 114
101 116
256 73
101 100
117 116
262 101
105 109
276 104
282 298
99 104
257 292
32 270
103 104
306 267
273 271
107 101
32 117
260 114
264 101
111 111
105 275
32 101
258 114
264 325
281 116
32 276
290 114
97 100
114 105
285 260
261 116
32 107
304 101
287 270
330 116
69 78
271 100
105 100
97 115
32 265
313 297
73 78
108 121
114 97
283 105
287 324
256 72
117 114
285 270
295 258
97 108
73 79
261 111
259 115
278 101
256 83
256 66
32 277
111 265
114 111
65 82
104 105
260 317
337 100
256 79
99 107
97 263
118 274
280 116
285 121
261 266
280 115
101 97
256 77
278 111
264 338
97 109
282 111
269 322
117 115
97 267
85 83
105 102
261 101
103 101
259 275
256 70
261 117
97 333
256 78
295 111
294 114
114 117
105 277
116 104
259 110
116 274
286 100
283 111
266 110
101 275
101 286
261 112
268 101
32 335
388 275
273 97
269 121
85 67
105 108
359 71
259 265
104 111
32 67
282 101
114 304
349 110
65 78
32 82
32 118
295 292
295 104
69 82
256 89
79 82
97 296
99 116
260 115
264 292
105 352
261 104
117 108
272 67
69 84
32 39
302 116
272 80
69 83
334 112
309 108
113 117
286 116
305 381
114 300
263 101
307 104
283 354
379 327
110 116
117 296
277 101
291 114
279 304
259 116
262 302
32 77
264 258
32 69
75 428
259 109
101 267
105 99
279 277
98 314
114 121
374 322
277 103
105 101
272 76
273 433
105 297
269 108
118 281
32 71
261 258
101 109
305 111
97 265
256 67
262 376
73 67
260 116
268 109
97 117
264 356
298 340
298 104
32 66
261 318
111 108
282 300
32 76
32 292
404 271
111 296
32 400
272 66
32 72
263 100
76 79
268 265
264 380
434 300
272 83
279 302
274 115
73 399
101 112
457 102
378 68
307 340
102 101
315 292
265 115
111 267
307 101
272 71
261 316
294 265
416 297
261 119
268 318
269 114
112 112
32 271
97 275
32 83
257 417
349 301
268 110
334 115
272 476
32 79
32 87
268 121
256 76
259 114
272 77
111 100
391 121
283 319
334 110
256 71
364 101
271 116
105 103
32 84
117 265
272 68
104 121
263 107
101 108
264 271
32 86
102 376
262 316
394 101
279 350
32 458
337 107
270 104
306 115
76 73
336 275
75 69
118 280
32 106
375 101
272 70
510 104
318 296
262 406
265 307
97 107
315 258
103 384
262 467
260 267
110 103
256 68
305 361
336 265
32 65
287 111
99 105
401 101
362 333
117 101
390 107
84 369
448 380
276 121
291 377
32 80
261 97
262 345
117 109
291 108
273 528
82 79
313 100
278 355
112 101
324 101
456 277
441 260
256 80
105 312
289 111
79 78
281 312
270 116
119 415
32 89
372 463
300 110
32 281
109 302
117 110
73 83
102 449
291 111
110 312
32 114
420 606
100 101
342 314
105 111
32 499
112 116
264 465
498 72
273 346
65 85
111 309
79 76
566 85
654 582
259 593
287 300
69 76
294 459
105 383
257 410
284 319
313 267
385 121
649 527
353 607
315 325
563 110
302 312
261 350
264 430
315 465
320 102
272 72
474 110
262 286
105 280
105 265
287 277
262 462
266 114
271 110
303 102
263 312
359 67
97 383
261 277
320 110
278 270
259 108
315 101
119 110
294 97
117 327
111 121
294 286
257 621
101 99
256 39
65 66
405 327
110 389
540 503
439 260
489 381
276 340
259 98
85 69
268 309
382 102
315 567
305 488
256 116
278 316
273 111
339 286
293 73
436 665
84 440
339 120
270 101
32 377
407 111
362 529
257 418
101 319
285 568
426 72
283 577
264 354
260 108
339 121
474 265
373 111
97 103
116 340
101 281
97 402
257 406
455 719
534 517
741 426
650 478
742 740
101 102
586 588
274 118
345 121
461 110
278 280
301 115
97 297
110 298
305 644
365 309
82 89
32 346
97 309
256 69
364 300
256 85
116 270
272 81
119 316
685 666
708 353
763 766
283 390
550 70
554 116
272 84
262 512
85 77
679 335
76 435
262 694
264 286
261 108
65 77
273 108
365 110
613 101
109 342
313 296
273 419
257 119
102 102
439 270
308 116
256 82
501 352
353 756
260 330
491 556
98 274
592 265
297 100
320 115
269 265
99 99
300 274
432 385
571 765
424 318
105 330
32 75
97 112
305 590
101 101
276 116
279 260
262 281
271 461
443 274
315 430
432 119
436 350
117 333
32 70
105 122
111 317
374 101
442 75
307 411
291 459
115 115
359 524
265 101
407 300
355 101
382 114
279 543
112 314
413 121
693 490
259 100
470 109
661 101
348 398
522 753
68 87
308 281
419 115
441 335
841 527
282 574
279 108
291 265
538 726
320 116
469 316
278 504
104 301
454 451
395 481
291 314
486 426
356 115
288 692
69 79
32 68
291 274
260 309
117 275
264 114
278 468
400 101
97 119
257 114
496 350
288 736
264 316
294 345
323 302
108 105
265 100
282 271
100 630
65 80
261 99
617 77
272 881
291 531
261 731
882 860
570 317
555 353
282 447
306 121
118 301
308 286
97 312
384 116
431 108
353 524
887 895
103 274
501 309
308 572
272 78
576 737
269 504
112 274
84 72
791 274
262 111
272 74
728 369
82 908
279 379
854 909
79 77
32 664
372 345
97 481
84 455
32 361
256 119
276 101
32 333
374 121
97 98
256 115
108 280
278 633
295 417
480 116
310 526
259 541
264 104
357 109
509 354
534 82
554 109
592 110
369 775
285 397
427 116
442 936
939 399
367 110
521 698
768 297
450 940
942 532
108 111
308 301
475 878
444 411
367 265
531 115
334 466
598 312
732 280
308 103
314 100
262 503
108 389
108 398
288 317
262 97
114 302
359 65
32 324
475 845
820 281
276 966
272 435
112 115
115 119
339 385
473 286
283 484
109 101
910 317
65 83
362 297
264 867
553 319
357 112
717 73
259 764
32 78
311 116
264 304
639 271
743 115
99 350
102 271
259 102
262 447
267 274
390 312
348 316
107 115
260 100
307 327
278 485
119 660
32 74
32 410
480 115
470 280
286 999
300 115
472 121
279 749
291 101
283 101
270 277
266 275
65 68
84 270
631 823
76 65
270 115
272 86
313 114
700 658
347 352
357 296
117 383
272 637
1023 1019
1024 1015
287 863
274 99
105 302
279 335
82 435
32 342
362 101
99 258
263 116
261 319
486 69
271 115
551 1004
580 451
307 414
85 1039
627 916
1036 1042
907 1041
305 468
789 414
810 314
278 905
260 352
65 76
101 265
114 453
469 684
364 270
326 853
1012 89
257 484
67 69
119 418
353 1058
486 1056
84 65
105 321
920 525
111 115
272 82
264 276
681 100
99 280
357 115
261 314
105 445
816 115
257 346
102 116
337 108
636 101
265 116
285 652
277 116
521 498
1081 827
105 274
305 346
315 418
560 111
283 1047
464 115
656 296
294 640
713 258
102 354
287 335
269 386
415 277
561 265
591 280
309 100
108 309
424 312
449 116
259 800
715 275
117 100
407 316
69 89
286 107
272 87
339 267
382 110
407 298
290 596
101 119
285 301
271 107
348 338
272 651
349 516
485 317
256 98
291 346
291 365
368 107
470 112
857 369
274 116
263 115
291 801
97 314
293 86
291 322
786 111
479 1068
279 266
101 444
363 526
346 321
99 108
305 117
372 286
450 76
263 389
273 588
602 445
291 993
339 1099
356 277
379 314
97 427
405 98
514 82
952 111
257 338
261 109
105 314
114 316
322 121
257 361
279 111
278 265
287 397
580 90
269 355
373 318
439 121
451 72
700 1166
1162 1167
269 686
518 572
716 412
730 115
811 466
475 1168
121 368
109 281
279 380
105 397
1057 605
98 398
273 516
111 833
283 748
256 99
432 321
631 1115
271 309
73 435
285 462
257 265
116 121
103 319
332 412
273 418
281 482
601 620
364 752
674 792
287 805
297 265
319 104
287 350
294 108
809 327
401 493
817 111
1161 1180
278 818
373 116
757 352
347 330
116 119
269 302
551 292
102 562
322 104
378 87
1217 498
571 73
1108 1218
1220 75
105 120
279 258
85 84
1008 1182
262 516
97 327
269 361
379 112
270 414
279 681
515 792
976 84
100 115
103 321
431 967
265 110
515 1195
72 779
76 451
269 346
85 1240
101 321
480 102
373 258
879 1242
436 1133
279 417
564 104
448 300
663 115
283 868
964 112
305 108
262 814
375 312
264 567
612 355
279 898
71 69
73 76
269 556
77 369
282 468
445 263
584 695
747 453
98 116
540 301
332 116
373 1011
278 260
307 280
441 319
426 476
339 664
1151 1224
1275 1239
1277 399
105 319
407 271
428 66
318 100
265 114
362 352
653 1282
1286 617
505 1287
404 433
771 1030
1290 369
455 83
560 381
262 629
291 858
514 1278
1288 582
108 116
970 274
264 111
285 114
282 307
118 512
722 1175
900 755
276 115
257 843
671 309
286 121
99 314
315 338
473 378
856 758
597 111
84 637
108 102
118 121
271 121
377 333
111 383
600 110
291 1095
78 69
71 378
112 652
269 695
372 118
272 75
269 280
584 467
294 415
883 342
286 482
313 541
279 574
273 864
865 484
1312 1324
1338 451
615 892
262 270
348 533
281 115
339 265
283 398
101 569
283 443
564 258
261 684
65 904
779 1261
349 338
109 98
323 319
367 121
115 398
990 414
334 992
1260 517
99 342
601 317
261 813
279 495
386 121
276 411
442 68
933 69
347 1356
968 1359
382 365
1103 300
930 304
495 640
378 963
1203 112
287 706
318 116
273 286
100 316
283 389
312 488
336 525
634 493
457 583
602 397
707 499
732 101
388 974
1328 1350
1389 1374
365 643
273 368
277 115
291 307
105 507
405 110
273 1076
413 1299
279 104
424 275
97 318
356 565
961 355
112 277
288 98
269 397
272 455
806 301
412 121
510 101
260 466
754 635
761 110
67 1050
1407 1414
1415 399
1084 745
598 1144
279 1265
111 297
324 280
984 111
348 346
262 1097
106 1135
105 118
105 317
348 265
364 463
475 596
985 302
368 116
1071 525
306 110
566 728
108 301
479 280
392 296
470 1215
287 614
1029 116
257 781
811 110
861 818
1391 1284
1435 1292
112 340
288 385
276 271
308 108
440 67
1262 121
257 1123
269 117
322 101
305 114
109 813
972 1385
643 321
402 946
264 938
308 100
32 105
1351 517
73 65
485 297
270 321
610 297
377 1303
471 116
105 628
615 316
424 1101
894 1373
450 1464
278 361
302 115
105 360
304 319
256 109
345 101
336 108
311 296
357 116
372 321
442 84
545 107
261 595
353 83
273 447
269 111
261 274
538 354
338 384
430 317
437 111
674 1486
1392 309
311 1459
1321 1460
1497 1489
73 378
836 118
370 1200
598 297
1501 369
334 309
373 104
82 1502
586 1509
339 490
108 633
413 503
1194 300
365 121
101 368
256 112
313 115
279 365
620 444
514 879
1521 1315
1213 578
1270 1077
1522 1062
109 112
89 67
306 275
371 115
260 327
529 444
401 267
450 912
1533 827
761 1404
264 453
357 490
641 528
84 653
262 1040
262 1027
469 1010
1527 399
1173 482
1272 1268
1117 1539
1546 1543
362 280
256 121
869 1216
284 843
759 490
306 265
375 360
264 578
378 1060
357 1147
437 1377
112 281
109 115
111 102
105 271
302 121
353 455
256 100
104 1283
278 302
1160 394
1141 1556
315 380
291 523
391 376
505 322
114 669
799 463
454 1469
934 115
1447 100
771 1566
348 361
281 274
353 86
514 1582
261 342
100 100
100 274
689 99
305 105
653 369
900 442
388 1298
1406 1142
450 1512
1583 1589
261 281
83 80
454 617
306 116
747 301
258 100
440 79
555 378
634 793
601 360
291 433
773 369
837 398
1597 1596
933 1606
1608 1601
256 102
105 97
286 115
107 281
283 316
85 607
420 318
370 317
307 271
308 97
279 361
1451 1616
555 1622
261 390
538 419
424 265
264 516
469 996
313 596
291 609
927 342
348 962
473 1445
401 99
319 274
105 333
256 104
306 108
857 666
372 112
1302 565
560 556
1482 988
278 495
362 583
593 296
806 533
931 493
437 1494
101 121
305 265
266 109
257 478
341 263
272 69
305 319
307 116
273 828
1504 668
117 466
386 274
912 80
431 350
612 119
613 394
775 68
1334 121
494 1234
349 1016
454 1662
266 108
691 265
272 89
651 76
385 115
279 609
97 647
454 1674
1678 963
273 731
261 747
261 1479
261 1230
1329 1204
274 121
117 309
284 1119
1673 823
121 98
278 281
288 463
105 342
799 591
1150 1425
344 115
532 274
1192 340
735 605
285 828
874 115
1367 1263
1670 1106
302 99
269 682
259 119
88 1564
262 274
78 1465
285 751
454 79
397 479
264 1148
968 84
1689 1432
705 121
729 115
745 116
653 773
1017 1718
1719 1708
875 333
580 1706
1710 1722
983 271
1033 115
287 1187
281 897
420 111
428 83
264 263
272 65
117 280
273 678
405 541
1158 1449
424 325
264 595
114 484
257 493
344 526
1233 1729
961 106
544 1599
1360 645
1743 635
975 1237
98 121
265 109
389 1727
373 316
509 651
283 394
278 410
837 277
674 1741
676 107
82 1060
1751 1757
1126 384
1294 951
98 1319
372 102
66 440
364 274
66 89
256 75
1742 1364
308 307
989 109
437 368
357 458
279 532
559 1310
370 277
283 1717
70 70
258 110
904 773
261 263
714 115
401 281
262 319
289 317
315 356
1778 1763
1785 1666
1590 1786
256 398
283 533
612 297
1430 959
259 787
1653 274
1300 101
580 1776
295 406
73 68
553 577
262 277
355 280
114 301
261 447
355 300
101 385
392 280
305 1581
1484 781
1541 121
1626 1059
116 281
97 99
676 482
265 108
258 115
261 276
100 304
435 1323
32 1817
693 1317
261 345
1567 897
494 317
414 115
372 525
1000 449
1301 793
636 280
715 298
777 1052
1122 1325
97 324
750 274
289 1697
117 267
419 110
256 86
279 430
357 99
704 330
783 115
118 342
450 1246
306 104
335 115
32 338
405 265
440 68
105 444
454 82
305 461
560 488
597 355
400 1092
685 69
1849 1854
282 755
279 821
668 1562
112 108
341 499
416 296
99 97
97 122
377 826
97 355
312 321
615 1022
1617 276
980 562
109 274
371 107
1450 1466
342 121
397 104
256 412
1032 402
507 301
1877 1761
111 1034
495 1059
271 1395
257 1421
1632 402
120 116
264 307
259 318
294 318
319 115
384 115
387 526
400 116
259 402
260 412
815 309
535 115
416 826
473 1080
1110 101
505 1878
110 274
110 111
117 112
105 368
312 100
364 345
784 101
279 482
405 787
283 1835
591 301
1508 380
716 115
894 1853
1031 590
1327 427
1456 595
1571 277
1825 1280
98 108
314 116
424 296
259 103
789 119
304 302
262 365
263 321
273 360
509 117
1330 625
110 447
437 270
291 443
501 100
650 286
1648 795
289 630
689 112
778 384
639 1034
1222 116
819 1574
1580 447
553 1636
348 1738
76 69
282 419
73 90
269 821
263 97
1620 1157
373 350
576 660
32 354
1797 524
690 468
258 1578
76 442
1957 1947
322 411
261 427
486 354
570 1409
644 635
1483 410
661 296
750 678
279 755
1117 70
431 1246
1968 1954
1681 625
586 1958
1972 658
496 302
103 115
315 104
276 258
256 103
293 115
369 78
540 1049
345 394
565 100
273 595
639 826
357 748
1933 645
950 572
1001 110
1018 100
1806 368
257 1530
1383 121
1537 402
564 1714
118 111
308 99
98 115
311 102
501 466
278 1157
343 526
105 481
520 115
394 338
676 1137
110 301
515 1051
264 337
544 281
416 309
440 83
522 296
115 1229
568 115
312 647
614 795
1020 115
305 1052
1231 402
2010 1619
69 66
117 97
336 286
713 111
260 99
676 346
631 260
391 316
311 99
374 698
364 97
610 102
576 286
367 309
329 115
1428 596
357 345
373 112
569 115
101 525
1093 115
67 524
786 1873
262 682
372 875
420 1243
839 115
1066 665
2022 1233
1033 100
1244 389
306 1646
1977 101
108 2026
521 2050
2056 1188
103 117
295 418
111 112
273 1119
79 87
294 275
256 97
906 383
277 280
279 286
1022 301
436 105
273 365
337 112
273 376
313 1316
290 412
507 107
291 512
515 443
1443 457
614 112
720 698
785 638
278 1426
529 949
584 1104
2005 111
521 1956
262 263
257 274
291 286
2027 738
295 338
570 107
1070 507
345 115
1065 304
1897 1698
368 109
372 108
99 389
562 368
507 115
112 495
431 1881
658 517
750 112
269 1657
659 115
894 1987
269 2095
2055 1661
967 115
1074 98
264 1078
514 1980
2114 68
2115 2104
339 1227
308 1495
1602 2043
2068 1652
505 2120
361 104
306 764
257 281
1018 109
257 276
496 304
103 280
284 101
110 300
279 322
281 327
1199 702
2077 751
278 394
520 110
105 523
448 562
269 595
603 107
624 377
1470 478
257 1129
431 807
1492 297
1139 938
1423 333
288 1559
1124 1563
1925 1586
102 2075
835 115
405 276
84 119
79 80
273 1346
679 386
416 890
265 296
32 297
261 307
1682 853
342 115
264 379
104 381
398 274
109 512
278 578
627 369
278 629
600 773
261 830
391 1982
264 997
1476 119
1496 1437
270 1600
440 1945
2037 412
1713 2169
2171 2178
90 65
491 1963
103 301
491 2110
269 276
279 271
373 809
348 318
264 443
404 1880
261 406
259 444
450 65
509 1703
264 1696
619 296
534 627
847 996
985 281
754 1176
391 1333
1383 677
1201 2015
2198 2182
2205 517
264 1803
2195 814
261 301
337 309
102 355
265 119
278 114
1228 297
269 590
1223 101
262 1711
98 360
361 312
291 361
1067 1671
545 995
1031 274
624 1156
427 115
470 301
2126 314
291 485
105 583
674 440
431 2085
761 466
291 1129
847 652
884 115
1029 309
434 1113
305 1273
1381 100
856 1402
1028 1862
432 1884
707 115
362 969
319 410
336 591
264 97
2046 385
257 121
258 265
615 384
584 386
118 335
308 988
273 276
305 286
307 115
319 327
332 103
439 397
450 1795
2230 1263
365 116
68 369
300 415
2261 1366
410 296
102 414
1141 651
1908 274
339 706
2269 2264
848 116
1084 101
1724 2151
1248 402
1138 1831
2262 1323
1223 274
1212 1051
99 340
98 101
261 574
1655 845
68 65
390 296
261 107
115 280
264 270
270 102
107 280
73 1030
327 645
265 748
505 2241
332 98
337 102
357 103
391 512
486 1366
261 668
365 112
962 645
611 304
1707 482
318 412
757 327
437 281
279 443
626 107
264 543
570 309
799 443
1394 1471
332 1192
261 660
690 484
117 787
1002 449
639 1010
1212 356
500 1384
2211 1178
2245 2293
1953 274
555 2292
2326 2285
117 2323
2008 1092
72 78
111 263
346 280
278 117
269 577
2036 605
293 102
108 296
272 378
327 109
362 795
264 321
273 335
269 345
356 104
385 110
411 115
461 115
906 297
1588 490
543 121
401 1316
690 2294
683 625
83 627
555 1749
305 752
822 301
2106 314
521 1267
2045 301
1549 260
1558 605
262 1893
2070 736
79 2330
687 115
256 266
110 107
1928 1744
278 678
257 97
357 100
2339 532
259 99
260 110
280 104
715 101
112 280
800 389
489 686
291 316
479 274
283 345
610 112
564 801
305 377
1923 737
390 327
302 397
271 402
1771 386
391 406
99 417
720 116
117 445
114 629
109 795
494 280
264 721
269 781
569 988
538 682
373 684
273 749
2161 2290
822 572
2034 1813
869 260
955 103
955 263
1002 342
370 1075
117 1098
1618 2137
1585 281
544 1858
273 2286
298 115
73 82
78 84
67 65
285 346
496 543
279 114
258 109
278 1107
493 647
547 312
286 270
269 286
116 301
318 109
489 389
373 119
278 377
296 398
373 694
478 115
117 531
431 104
868 100
1737 115
117 596
391 467
103 495
300 523
105 531
570 412
416 583
261 1267
1121 118
2194 916
720 112
279 758
790 101
883 628
1413 958
1821 445
2031 898
600 2328
2445 116
2452 1765
111 275
98 98
334 267
76 89
311 414
256 110
1241 643
277 97
1070 1520
287 298
305 298
269 314
1677 629
532 277
277 335
339 118
777 115
544 318
571 2101
405 109
1301 468
493 110
1496 625
73 580
602 342
432 706
634 99
261 805
1931 276
991 121
780 1040
1690 121
1160 345
1728 333
1241 745
339 1353
437 1848
1885 274
509 2476
105 112
114 116
273 361
1454 121
553 386
437 300
1485 115
73 86
346 352
612 529
117 352
274 110
546 115
262 368
505 2475
269 300
335 110
289 692
1134 2397
1205 115
355 321
32 386
2186 414
109 398
491 101
2526 2390
441 280
105 453
515 101
537 100
269 922
420 1204
611 2429
678 100
1053 360
313 890
893 321
1976 304
907 2365
82 1106
514 1188
1638 356
570 2014
303 1810
262 2100
2069 2373
405 2415
972 2461
2486 65
413 2487
2509 2012
2542 2421
115 111
108 274
544 1267
279 507
291 281
272 658
107 301
612 99
283 324
307 321
1979 922
880 682
365 327
553 354
531 104
117 361
929 419
383 115
298 411
469 298
1009 345
468 121
1249 260
66 2062
108 578
2559 2577
279 1864
611 108
1066 2552
491 651
2583 2420
453 738
509 748
544 893
273 2258
405 2379
873 115
917 402
1067 702
280 1098
1249 270
434 1320
2516 97
1605 721
1752 342
1394 1692
546 1816
2039 606
279 2265
1770 2529
559 119
315 2401
108 115
413 103
116 111
99 121
1062 71
339 307
350 111
85 82
117 321
256 74
906 277
768 296
256 51
1343 645
1124 108
110 633
288 119
269 2441
564 2303
311 115
279 314
285 461
851 523
288 541
437 1395
469 2054
115 903
365 115
367 318
400 102
269 377
562 2619
32 668
2112 1827
929 377
502 104
283 686
591 281
469 263
473 121
32 476
771 89
918 325
1120 101
305 543
279 590
332 630
349 1127
276 677
780 2376
683 274
453 735
611 2324
759 265
778 752
279 807
810 321
259 949
120 1092
2610 708
1074 2079
848 2102
2213 568
2440 2396
627 2665
256 263
111 271
282 316
2017 959
690 2167
115 104
430 296
1985 389
412 2674
314 121
262 355
263 280
374 280
285 706
101 280
368 115
278 386
443 523
121 301
368 412
304 280
32 355
864 121
357 98
361 119
261 365
118 386
410 109
308 443
620 121
273 485
1694 115
529 276
591 321
614 98
307 681
1473 115
106 695
256 753
819 271
287 830
880 286
111 2425
1154 543
1332 360
256 1561
1634 1078
1640 459
1762 478
2706 1949
115 99
865 276
301 274
273 532
286 108
269 281
265 121
98 276
283 922
460 360
339 356
104 516
332 109
1209 398
273 338
301 360
1847 73
101 463
315 379
291 384
410 101
2569 108
348 410
2135 110
269 758
257 419
97 449
1017 2419
2748 71
2749 2550
956 402
555 2670
602 628
474 640
2713 1612
73 658
696 301
362 890
364 821
903 533
778 905
264 1126
491 2541
1248 312
862 1769
661 1526
1952 360
548 2302
269 2306
1558 2395
790 2612
454 2737
2772 1062
122 101
259 121
467 304
611 2747
1382 301
291 117
1705 1148
439 568
103 103
98 321
286 110
1252 638
1071 119
32 322
101 493
257 271
114 271
277 121
279 97
334 114
291 276
100 301
321 453
270 565
311 106
321 115
713 292
2273 1191
265 345
111 385
105 386
388 100
576 1280
111 826
441 390
443 415
544 116
521 2466
489 1005
496 277
1832 797
2103 2389
597 504
2146 121
618 296
262 1427
683 628
311 1901
2080 1959
1188 65
434 809
836 109
856 356
264 1427
989 312
262 997
550 2664
273 1083
279 1759
610 1866
1254 345
434 1346
1618 1083
990 2083
1731 275
2607 482
2304 2700
109 321
2408 481
806 2720
122 281
2383 677
2296 355
107 321
1009 2797
259 112
117 368
624 993
2199 115
261 430
118 507
642 115
1190 1147
519 296
1065 1365
805 98
624 108
339 109
313 112
410 647
808 274
262 321
392 304
332 970
281 389
2340 1191
683 478
570 296
2375 414
100 402
269 365
1879 321
676 327
273 956
261 379
273 394
394 280
395 98
1348 265
345 2023
1430 2578
284 419
432 383
2168 2477
494 2345
454 378
2889 637
489 300
448 1005
264 1123
262 556
559 107
559 99
103 605
1595 309
357 668
97 692
424 2253
288 800
2698 645
323 1402
1772 2484
102 2693
1017 765
1209 316
422 1384
2564 569
2657 281
1523 783
558 1823
1748 645
2215 258
1602 2823
295 119
114 324
294 317
355 274
283 302
558 414
326 101
437 384
264 277
32 88
2638 271
97 325
1542 274
296 274
309 116
306 98
286 301
297 108
100 314
362 797
348 271
357 102
295 337
641 793
595 115
473 1027
273 2568
707 1420
261 562
382 322
279 410
392 103
1937 997
401 307
931 384
1822 281
427 280
114 445
320 466
97 583
278 482
283 629
1997 898
820 101
505 2755
1834 876
395 721
262 813
371 830
315 1148
973 274
985 98
307 1037
283 1865
2911 319
1185 115
97 1310
1634 532
1405 1650
1739 112
1399 2210
2228 312
610 2632
584 2331
1399 2566
308 2732
69 87
285 590
110 121
308 275
2434 726
298 116
262 322
256 258
104 110
566 442
2499 1318
257 342
283 281
291 319
485 117
720 99
370 314
304 263
308 267
303 116
479 1072
297 121
261 893
283 300
2983 637
261 397
302 103
98 302
312 276
306 109
611 2883
311 100
274 314
1080 342
273 462
319 121
261 327
344 1384
339 102
486 378
509 3007
348 111
449 286
354 115
1753 2368
373 117
2926 73
348 381
348 384
269 2066
3022 84
929 495
390 309
891 115
283 501
610 2277
356 411
1216 271
1002 2753
1121 643
283 467
357 1200
434 2685
2289 1816
611 114
480 458
492 100
273 488
509 319
269 563
404 588
598 267
612 102
614 101
983 300
848 1144
278 749
314 758
759 110
391 814
287 2962
1254 1318
629 951
105 956
117 992
551 997
3068 635
276 1037
3021 1531
269 1319
1300 280
1122 115
1272 481
1325 100
1345 115
348 1346
1405 321
348 1516
1584 628
1637 324
750 2760
1273 1747
1031 1759
538 1891
117 1920
2144 3087
1936 115
2259 298
491 2000
279 2111
778 2166
2232 111
2308 402
2338 2756
489 2593
515 2637
2653 635
1724 2679
491 2914
3033 524
364 1107
115 112
286 327
100 281
272 79
450 2613
273 1113
934 121
273 101
2729 335
339 317
374 569
318 108
920 647
2216 995
764 115
824 115
777 109
1139 386
300 98
273 307
313 318
427 609
261 335
614 3015
454 2796
1088 1229
391 101
392 301
431 97
401 368
273 410
386 411
779 80
444 321
400 449
472 1900
451 440
491 111
105 669
278 1635
265 640
496 108
496 380
475 2725
348 1104
262 1411
690 488
600 466
624 114
291 636
641 302
117 643
667 263
1605 1467
707 377
1549 335
2105 1401
774 115
103 783
3136 2354
914 360
927 263
927 114
1164 2122
273 1049
278 1063
262 2575
3108 1315
1139 389
118 1149
2041 274
3143 109
634 2708
279 1677
259 3040
2113 2051
262 2204
491 2903
262 2688
2743 383
520 2751
111 2991
3122 1156
652 100
116 115
65 84
261 324
420 342
275 300
703 115
1358 2436
256 108
477 484
66 85
73 71
3198 627
683 2382
1713 3199
1568 115
109 276
256 276
388 333
390 490
615 453
259 355
112 318
1121 386
260 640
1231 609
265 321
276 321
258 345
551 338
372 103
291 368
832 115
257 482
394 342
269 2809
2409 286
362 386
1655 88
624 1095
473 814
296 453
401 385
541 121
372 2525
98 1515
551 567
265 466
256 974
279 876
1118 876
504 301
515 300
409 526
559 112
576 504
597 270
610 118
2113 327
641 298
322 645
716 360
278 669
279 682
906 797
474 736
759 706
76 1106
774 915
930 919
931 321
2947 569
2666 104
1770 335
271 1072
1113 270
279 1137
1139 415
294 2690
1651 319
1397 578
1102 1411
1440 481
1443 414
492 1578
2084 402
257 2388
780 2446
2482 1870
473 3186
2489 2872
521 3163
3197 756
3201 399
1066 3189
82 65
377 121
278 1059
2451 533
1241 352
284 390
263 301
412 793
305 342
634 1317
276 280
307 301
518 1561
101 345
104 863
278 263
485 102
374 319
273 893
304 112
305 97
256 309
332 312
356 107
2726 745
2154 356
1118 702
374 114
285 377
494 301
569 389
400 121
489 574
396 2281
413 277
404 419
422 115
291 686
314 525
459 321
273 459
391 462
348 468
374 504
287 2443
109 481
437 485
401 490
1028 115
2311 115
559 102
559 98
3095 669
1341 274
600 267
2087 1230
432 2859
272 700
641 721
727 115
348 1613
757 100
404 2928
1163 115
2712 312
825 121
1730 414
836 100
871 115
256 989
114 1010
1134 296
264 1149
1254 858
336 1309
271 1409
391 1481
1621 297
67 1795
3281 3360
1799 412
2692 314
436 1924
3037 330
2394 1748
2405 1063
2481 1069
3158 345
1000 3185
509 3262
3328 119
308 102
374 355
571 263
3019 1076
1493 115
480 1138
279 318
660 321
1159 385
115 258
72 2155
515 274
264 265
269 97
780 801
346 286
420 562
733 572
265 280
281 280
610 1303
404 485
312 275
110 523
297 275
661 360
84 435
118 1072
119 325
322 959
436 3402
1194 1005
355 342
304 356
357 108
2374 458
450 2111
473 453
372 368
32 385
2478 427
283 386
279 394
1772 1365
407 101
437 1155
364 419
543 300
494 100
271 445
264 2132
287 507
66 1050
279 1187
1248 1235
3134 276
554 346
722 298
573 296
111 620
97 1101
637 84
3399 3254
424 678
689 109
715 280
339 758
306 2268
576 919
946 383
964 735
761 992
1074 368
2731 121
1120 322
3425 84
2647 3448
311 1138
1149 271
1154 111
1237 327
1440 335
1491 298
1640 1157
407 1804
332 1870
2942 3247
448 2212
357 2239
2249 1052
273 2432
2739 2337
505 2784
2998 1686
480 3004
2084 3162
3375 1744
637 3383
3410 2023
308 266
1837 625
597 280
1557 115
285 3067
65 75
489 516
117 98
323 307
972 115
361 444
101 107
108 112
355 751
600 3127
114 533
434 752
256 111
264 706
295 2741
837 478
443 101
420 406
304 274
256 270
1158 3070
559 108
348 2071
111 298
1792 1401
984 478
415 281
768 583
584 1879
759 120
273 384
1151 3477
559 115
420 101
353 3279
3508 3511
348 922
435 68
448 376
269 461
281 669
278 467
755 100
305 633
489 386
600 108
493 342
114 504
1595 533
431 3000
3526 1178
551 101
553 111
118 578
2561 876
1358 116
624 322
437 625
3055 3018
431 3084
560 644
689 103
848 1841
305 749
786 625
1811 340
679 1364
807 274
576 3135
278 864
101 876
302 2680
72 912
1516 445
269 919
923 104
980 342
427 1612
346 1075
2249 962
273 1243
1253 562
1337 115
1454 1137
2498 2219
602 1477
2384 258
2103 105
1638 686
1651 281
420 1801
2515 625
373 1858
1863 321
305 1891
291 1889
119 1924
1212 1940
348 2060
305 2677
2082 462
506 2122
391 2204
469 2297
2164 2337
269 2347
2367 297
274 2470
257 2643
3549 976
2777 1949
2821 1360
2831 121
2581 2971
2995 103
3047 684
305 3115
806 3174
564 111
379 265
115 479
110 101
416 463
320 267
796 263
306 100
71 442
392 271
112 263
636 2007
256 107
109 110
356 99
382 640
2861 647
256 101
293 116
1057 1732
86 1847
434 447
650 352
1859 892
424 531
2098 447
791 523
690 3118
667 499
281 281
2651 565
276 507
542 2973
440 1765
109 277
116 314
1978 381
261 1306
321 1072
615 1698
110 307
111 360
372 99
1660 115
339 314
3600 1243
101 317
32 321
302 327
287 2263
557 526
848 3173
108 695
361 267
3246 1810
1001 643
374 108
279 2776
395 309
263 445
573 271
271 482
394 112
339 735
1739 647
403 300
111 415
2243 628
82 1292
418 300
364 628
448 114
415 462
3309 503
3624 1178
112 562
416 1175
444 721
569 297
264 751
759 878
612 427
733 263
627 69
3615 3678
550 3679
854 440
339 1526
641 595
869 504
97 787
722 383
264 735
750 668
348 2066
851 274
856 345
413 897
2463 111
918 338
923 111
1363 115
3465 3667
2435 112
334 1098
269 1107
790 1133
3257 121
1150 296
1154 1155
862 1381
566 3628
1476 692
273 1515
1529 629
1536 277
567 3597
311 1769
1832 297
847 1831
305 1864
259 1996
432 2099
2216 107
3495 2931
2927 453
273 2723
2766 1888
2787 414
336 2799
2921 2058
836 2997
601 3192
1253 3352
3379 99
1249 3406
555 3434
305 3503
1367 3603
2144 3626
2220 3672
3731 3663
3733 89
270 280
308 258
270 97
285 2267
430 309
114 115
279 565
2032 890
259 324
298 258
100 121
1050 440
322 280
597 512
2495 638
2309 314
88 70
264 1080
3501 115
492 525
348 307
1213 2177
283 996
1190 3542
32 280
112 319
324 342
264 342
649 77
918 465
109 411
99 266
283 286
551 2250
279 265
280 121
1135 271
2683 1800
287 276
1190 345
1704 101
3107 3754
1016 411
312 267
287 355
287 365
278 365
295 322
379 277
279 2332
491 2727
348 286
726 104
627 68
2422 297
372 119
716 110
1503 721
641 3609
388 114
544 3719
2636 1614
256 400
415 115
1103 1005
1734 274
417 116
279 418
291 427
912 2012
256 495
1508 300
97 444
101 445
346 445
477 98
480 106
484 115
1772 117
518 263
544 479
1295 301
600 112
608 296
261 1229
892 100
631 335
256 635
309 1353
3605 411
646 630
2986 121
671 314
690 356
693 118
3310 307
2633 1379
371 3320
295 781
1070 668
790 280
306 2503
3749 1465
810 301
874 301
610 903
910 745
624 2672
946 797
266 969
1000 1420
1001 263
3807 451
257 1077
372 2239
437 2585
3779 1366
1637 270
955 1127
1201 1049
1588 583
348 1243
2937 109
1300 638
1327 721
279 1333
261 1343
1705 406
1371 523
257 3633
357 1381
1397 115
291 1401
1403 115
2955 111
2902 3039
1648 98
473 1711
1752 98
1863 101
1960 628
1985 2003
282 2017
2033 389
3306 276
3768 101
2105 919
2263 1777
264 2229
2630 342
2256 1840
2393 402
2453 951
2465 468
259 2512
2532 101
2669 1028
1997 2691
277 3211
100 2695
2779 1919
2881 924
372 3076
3123 368
584 3550
3178 609
3190 833
1017 3840
3322 340
264 3380
257 3485
571 3584
1066 3766
521 3850
3910 3791
2826 453
420 495
507 1222
261 302
1519 296
416 100
401 356
256 277
269 398
103 111
114 277
101 103
32 274
754 3573
1313 100
83 65
2155 3928
1617 1306
413 402
66 3282
321 301
952 427
825 115
318 277
418 111
72 89
76 524
279 368
689 100
786 3673
2557 335
99 301
336 447
338 301
624 274
264 2166
317 304
750 1126
373 266
298 101
281 110
399 3938
1064 115
3510 602
103 314
289 112
291 263
72 442
256 296
278 319
338 115
112 301
2490 115
111 307
420 478
495 296
970 384
257 562
256 356
532 3937
362 112
430 112
348 376
377 304
930 706
305 384
3048 274
538 316
1411 121
1703 121
390 297
1690 1063
405 112
410 110
397 411
261 1222
121 415
339 458
437 302
364 443
445 280
448 322
282 462
264 462
269 532
283 478
529 3144
3218 892
722 304
348 525
505 2470
97 2268
546 360
1009 302
342 565
576 276
540 577
722 98
560 590
2622 101
278 605
1134 318
2098 316
621 360
467 625
771 3586
322 824
348 1320
3875 1028
3960 2354
555 1351
634 3400
1009 1975
819 3388
521 3435
305 738
555 3929
2093 297
780 447
1121 2774
1102 397
3153 578
3915 3392
274 797
336 807
848 121
291 2900
276 3155
1937 2858
3335 915
862 578
862 427
918 380
919 445
720 1155
1037 280
1173 3517
1836 1685
515 1333
3339 4022
2984 281
308 1721
3132 1178
869 1477
990 1531
311 1531
641 2344
3338 335
3297 1900
2744 321
1923 1940
1960 385
3739 317
473 2062
1440 2218
1503 2585
348 2318
787 2382
3611 121
357 2621
2626 286
2667 100
2341 2795
2805 300
2867 682
282 2880
4023 3939
3166 1309
3225 3140
720 3395
257 3493
291 3544
279 3606
559 3635
261 3656
473 3669
291 3711
1441 3773
1249 3834
3916 444
3932 89
4066 4093
514 3954
105 3972
322 321
262 1445
346 98
111 99
1294 406
104 271
904 976
615 298
112 479
1470 2427
262 2518
510 876
790 447
602 302
790 525
79 83
69 100
401 386
67 72
3725 738
294 321
302 101
316 271
1029 738
111 333
2386 302
291 565
624 265
278 677
256 265
291 562
257 322
270 301
264 381
102 274
278 105
265 758
281 101
1885 523
262 2572
264 507
274 297
424 427
373 99
258 296
496 1265
539 115
264 298
115 301
269 543
1102 389
2557 1844
1007 115
375 280
308 119
1756 319
505 4096
2333 2847
273 314
614 481
1451 89
318 103
278 668
323 267
603 301
2644 2099
1341 1685
2093 797
2164 924
3784 296
778 300
286 677
273 356
279 1902
269 356
104 376
1529 365
262 1910
262 1016
273 377
308 3846
2558 276
2810 3548
394 321
554 103
357 630
410 360
284 1696
495 100
116 1777
99 3442
291 2538
1753 109
309 458
541 301
121 532
407 468
477 281
1302 2742
1967 100
1399 830
499 115
507 274
261 2016
264 532
525 116
305 533
1737 321
117 3812
983 807
335 578
372 1268
602 111
109 609
288 3827
439 828
1621 383
1262 677
563 628
2187 2863
279 1343
1185 638
289 1353
514 1050
689 115
861 355
3236 276
4220 4103
4224 378
279 2097
460 702
278 735
1266 638
3898 479
3532 406
1862 620
336 805
273 809
407 3238
819 108
470 833
836 111
865 463
469 3896
257 915
1109 115
924 350
771 3451
984 342
1018 107
3229 368
348 1318
1067 115
2573 386
1103 121
269 1104
278 3621
281 2609
1109 565
1110 360
258 3321
1266 115
1334 1142
1190 1353
720 1520
601 2378
1503 669
862 1531
931 1889
1571 117
611 1635
1682 621
1102 1686
1728 1614
473 1749
551 1777
611 4157
1270 1827
1964 444
1964 783
2917 111
2374 2016
2069 1675
1766 2130
576 2132
2644 1069
2274 118
1519 2288
4105 411
282 2704
514 3470
597 2738
2088 2790
2888 783
1595 2969
2996 1365
862 3763
1587 3016
3079 1471
3114 1466
3152 2054
3165 605
2999 3608
3385 383
3682 3647
3729 614
611 3740
3874 1574
269 3885
611 4035
291 4046
4086 2742
2338 4115
4154 304
4173 669
485 797
118 368
536 4004
306 114
4206 924
3966 3969
118 1844
343 115
108 479
276 97
111 101
1644 115
2789 783
401 2960
121 114
274 100
559 266
288 100
1587 2803
544 111
273 574
1187 116
391 447
1102 354
505 108
108 286
304 281
780 677
538 3420
306 541
591 386
117 1309
1254 3261
313 122
119 292
277 296
472 3396
3034 108
576 368
329 314
98 300
1009 2094
804 360
880 3432
1071 647
964 109
431 302
470 386
480 99
1184 304
1091 265
283 321
551 430
412 568
323 265
97 529
3452 504
308 4192
836 1675
291 507
261 568
3384 3883
3177 384
349 263
361 263
397 280
257 386
70 653
262 735
3008 4285
431 368
778 316
401 112
305 410
400 1063
374 419
2640 1227
2160 120
634 115
920 121
2308 304
339 443
4329 1234
269 2988
1348 121
453 115
459 115
540 751
489 1320
111 797
106 467
475 108
287 512
307 479
564 406
491 381
495 466
269 495
514 504
103 523
980 1401
2393 312
119 721
872 115
569 116
115 574
616 115
4379 75
614 342
388 620
357 620
105 620
1209 338
329 959
355 628
631 319
448 636
641 301
335 738
98 682
2019 321
1739 903
951 411
690 414
722 309
729 301
454 738
743 360
1837 2555
790 319
825 479
1124 858
847 111
108 868
893 384
923 1011
2030 4133
270 903
295 3742
2093 1959
420 919
865 919
929 265
1850 115
930 376
934 335
949 115
67 976
262 1155
983 316
869 1481
2979 445
1001 314
489 1874
282 1049
1410 638
281 1069
424 1069
1295 738
2471 321
821 1083
1658 360
391 1107
261 1127
1159 383
1205 301
307 1471
1228 263
1480 121
1403 281
553 1420
1428 119
1442 115
507 1455
1455 445
2504 974
1483 453
1491 286
1536 115
288 1585
1607 321
1629 301
1631 321
287 1660
1681 1437
1753 1560
3794 386
1832 583
1875 270
1901 277
291 2446
2088 1560
357 2097
3044 267
2138 360
2220 721
2243 342
2435 969
1928 4209
3941 384
2451 1155
584 2518
2620 384
1253 2807
2895 2621
279 3035
364 3206
3217 828
2992 4459
3415 386
437 3433
819 3453
927 3482
436 4112
4525 83
1122 3769
3770 402
257 3790
3797 112
270 3974
287 3993
952 4016
287 4048
4082 342
880 4134
437 4158
4200 265
634 4210
4228 897
1590 4419
1181 115
473 427
362 277
264 562
307 565
564 276
112 114
1367 353
398 368
405 275
107 263
600 100
2882 572
808 386
4513 1650
2687 3283
278 97
368 280
265 959
1588 890
83 79
78 4562
2228 1069
3956 368
112 321
258 267
623 596
1154 2953
4113 1155
2932 499
82 658
71 72
257 574
862 2828
261 458
391 286
1231 1235
865 1049
105 533
1503 625
1976 706
336 647
109 478
262 271
3043 121
278 346
1734 3187
559 958
263 121
265 103
361 1904
278 951
4537 263
537 360
926 995
836 385
3270 2703
2629 1065
112 606
733 1561
279 292
2523 533
348 507
611 377
117 312
401 1147
1492 583
323 453
437 1005
1394 346
431 1393
307 274
570 110
480 312
1491 2418
345 280
3028 541
71 556
373 319
291 4408
262 338
4612 3209
346 99
265 974
357 106
1002 2920
364 356
269 1515
373 752
1532 115
436 304
538 418
496 574
777 1721
431 111
477 3570
393 301
4092 4343
594 274
102 1078
2304 4641
847 394
336 528
405 383
861 111
3796 368
1102 2413
1067 327
308 415
420 114
420 365
493 795
436 1065
1537 1235
2837 115
553 484
641 1216
1361 115
83 451
1138 2635
307 4661
505 274
837 2662
458 101
368 462
470 98
105 490
478 321
259 481
2862 360
2256 959
263 824
505 101
610 1996
559 103
278 563
514 4317
273 563
517 4563
1428 1888
1124 302
3716 355
955 636
784 121
1838 354
1008 523
3728 783
348 3657
285 682
1875 260
308 4365
862 106
710 102
722 286
725 115
273 781
2296 419
785 115
790 493
257 791
1838 304
1629 321
257 807
2274 297
257 830
1228 119
434 867
279 997
877 412
883 115
262 1749
689 903
917 112
917 721
923 258
3816 444
946 297
984 418
1000 686
586 1847
4721 359
4722 3514
1644 296
2422 312
2513 115
875 3221
2089 4727
261 1893
97 1069
302 1069
295 1714
2647 82
1091 121
283 1107
584 1113
1118 360
4293 2850
1173 121
611 1156
306 1176
1792 354
1209 346
3113 274
269 1283
1295 411
395 1919
496 1393
534 2677
315 3357
1454 1427
1488 360
2992 4660
2247 276
3429 797
1627 115
1651 121
2033 276
2190 101
2287 121
819 1880
1066 1924
1529 1983
393 2736
1990 360
2370 444
357 2854
2160 1127
395 2218
2232 427
2386 1477
2683 1204
2793 1235
2879 445
722 2897
4442 3025
480 3011
624 3060
391 3065
3148 121
3537 1176
4545 379
480 3228
1519 3234
285 3298
3472 1316
3481 1671
561 3484
3638 635
3761 445
2573 3774
3820 3693
707 4102
4283 445
4558 1478
293 4560
1731 4570
4632 1477
1731 4680
4733 4572
107 274
97 102
105 541
102 108
348 377
535 301
322 281
2215 1600
3591 412
2363 115
1707 276
270 99
3145 1373
335 309
3643 3636
84 104
4611 3562
315 938
2430 1237
278 300
1964 1840
400 386
105 98
103 108
101 307
4543 302
394 301
1035 115
256 340
1091 101
32 122
345 118
1027 121
332 2703
4237 120
335 412
117 301
273 381
280 286
122 122
259 647
357 383
420 314
265 281
553 3983
1529 565
279 1051
261 121
3806 103
286 109
2976 386
346 383
454 512
348 301
264 301
309 3327
274 1747
279 340
116 677
273 105
115 274
285 1283
291 595
927 2427
117 276
1838 277
283 263
103 286
839 301
287 271
321 274
291 105
509 101
32 301
297 116
597 419
1846 360
394 115
291 298
278 324
816 360
361 99
1134 4882
102 543
256 302
1634 565
332 115
312 105
750 2447
1691 115
262 1101
4335 301
348 499
323 108
780 1657
643 493
259 327
1348 110
4326 1813
837 1393
610 100
345 321
2209 314
1294 2267
1450 300
97 360
273 461
261 368
110 368
368 270
370 265
405 101
109 376
377 275
2870 321
1736 638
102 389
893 115
2187 265
394 98
368 397
466 121
1017 2101
401 280
274 583
370 504
418 411
3538 2219
865 568
735 280
282 1149
437 280
780 381
1587 681
264 1229
690 1636
479 121
311 458
475 120
273 3982
287 485
307 488
491 488
262 4446
495 115
598 583
531 112
2788 301
102 528
400 529
284 532
1070 629
449 533
1530 115
1203 109
261 678
273 636
551 418
2794 327
891 301
1326 115
1682 1421
929 319
4515 2003
707 3661
837 3780
720 3889
2334 115
580 83
273 726
4302 296
600 275
972 1028
274 609
103 3976
116 621
634 2828
427 628
276 824
117 647
678 444
1154 418
264 1910
789 1156
690 686
1498 2165
348 1078
339 1841
291 755
761 112
600 764
1504 563
786 384
279 791
306 800
847 324
1074 383
825 360
825 301
1382 115
264 830
707 830
3556 2985
832 321
3424 112
1792 875
864 397
480 3999
410 949
1131 115
1302 488
917 265
938 115
4894 4815
116 956
374 1801
964 738
989 412
1001 296
1001 956
1960 342
1065 301
1083 312
1190 1402
391 1097
3034 466
1128 638
1134 309
1138 394
4807 453
1228 312
1280 121
1762 628
390 1284
323 1298
348 1319
929 1516
3044 640
117 1404
989 1904
930 4449
789 1421
269 1481
1026 1495
118 1562
2273 116
332 1904
4895 1051
4159 609
259 1660
489 1660
4169 3786
2699 115
4547 397
1922 828
1922 111
1974 753
1766 2041
102 3823
2118 301
2154 1051
2246 702
2259 488
4654 4666
2298 415
2298 368
2316 702
372 3011
273 2447
4849 2918
278 2689
434 2956
2766 319
3175 1926
2895 516
3513 98
3290 360
778 2956
3008 1520
3024 541
3079 1692
3085 783
403 3142
3151 105
690 3289
257 3305
4626 111
1190 3327
3436 296
819 3524
3552 380
4963 919
2878 3641
750 3781
3818 3554
105 3953
5096 97
3962 386
3990 368
473 4119
284 4121
4328 3230
861 4333
559 4402
544 4472
861 4857
4866 602
4907 415
4910 3232
4923 312
4932 457
4939 1635
4992 4922
283 342
257 324
65 121
4623 1619
496 532
73 84
348 660
256 1409
101 98
1621 583
424 444
564 4899
2826 301
515 270
3666 996
356 112
372 98
348 101
2694 4927
32 81
448 346
509 459
1484 678
264 355
405 99
99 277
101 297
1108 1803
307 346
1426 427
397 567
757 620
356 280
401 275
120 101
432 3957
269 318
1215 1077
1018 2676
3859 115
310 296
109 484
4954 4367
272 1012
862 3847
553 316
110 280
1210 115
338 121
632 115
931 1187
1112 386
980 652
302 301
279 5143
4820 482
276 274
1443 99
4947 858
1120 121
357 807
284 280
1931 738
260 1268
510 321
597 633
109 1865
420 121
285 318
98 419
274 301
1357 4501
115 411
2072 668
309 275
405 1449
99 304
449 102
2463 300
264 386
2030 281
114 307
4201 2954
323 109
262 318
4072 321
3563 116
757 643
98 556
105 394
264 406
340 276
437 286
368 309
289 345
102 821
348 304
3747 99
847 298
540 302
119 867
256 643
523 117
262 381
372 383
271 677
105 385
1519 116
1140 360
279 512
1887 115
388 109
262 389
441 101
4384 449
1766 110
1363 958
479 368
833 758
324 481
457 389
1417 115
2243 4485
1999 453
257 2000
416 385
114 793
420 108
289 427
713 417
1405 1425
434 298
437 338
257 543
108 484
263 444
437 507
2351 4417
734 1075
372 1138
880 821
283 462
810 281
473 263
659 1478
116 479
289 504
1492 797
778 2502
2805 1005
285 2802
592 736
517 85
496 482
2372 951
509 501
3299 119
538 384
1944 274
723 481
544 99
559 296
5135 1178
564 418
564 286
264 568
571 281
3052 897
1341 4413
584 298
288 591
1159 787
602 280
608 274
586 617
288 620
955 302
860 77
1327 2572
291 898
634 103
1965 121
1939 115
2405 121
391 1563
285 660
2554 1804
917 1467
287 682
1102 3519
683 479
424 692
1734 360
931 4401
932 115
116 737
472 738
2894 386
1687 321
777 346
117 2332
1027 721
790 105
799 100
551 1261
373 1479
282 807
283 807
291 809
1503 4007
401 820
32 3936
277 824
98 824
759 1227
2370 949
835 360
1413 1310
849 274
1621 1075
1121 383
5138 1866
405 903
276 915
917 263
917 427
479 924
362 1614
2404 115
930 276
82 1188
5157 5344
611 4327
5346 4321
676 995
279 1011
269 1022
720 5315
1064 274
1102 3405
362 1075
5154 1685
257 1097
4260 1436
1112 274
3175 462
364 1149
3353 101
3613 4906
1226 115
2988 321
4973 97
257 1333
2722 301
1354 301
750 1360
1620 4486
1852 296
931 1420
1150 3630
261 1432
1434 277
1440 302
372 3968
2831 312
1456 307
722 2464
2894 1364
119 1516
1754 5382
1544 1176
1627 1005
1632 897
1558 1732
1799 296
5388 2954
3408 893
5288 904
397 1814
2342 5309
4146 345
1850 301
295 1874
256 1901
1964 949
4512 402
689 2058
311 2083
261 2130
2156 301
2251 360
3436 114
262 2306
3642 402
1881 2389
707 2413
5291 1564
1141 5410
2450 115
2474 109
2532 280
2650 453
597 2695
416 2697
3437 368
3703 276
305 3877
2867 419
2874 296
929 2875
2896 924
768 2897
2938 1686
3010 2177
3012 484
3111 528
515 3206
3299 414
257 5172
3460 100
3658 314
571 5097
401 3949
3970 565
4527 309
348 4156
4178 342
671 4243
4573 1765
4370 4168
357 4896
1799 4420
4422 368
4441 781
880 4550
4551 281
4615 368
4767 116
4805 2291
4371 4937
2469 4975
291 5023
544 5109
259 5148
5318 5266
5458 5442
5182 1191
5197 1318
5211 1309
5212 1814
5228 327
439 5240
264 415
2067 1137
346 102
300 108
278 801
302 110
273 3213
946 583
97 541
542 110
257 563
613 702
326 321
955 117
4663 333
354 274
284 277
733 277
119 101
2561 5468
432 307
2474 3933
479 645
98 322
117 103
1224 1666
341 3897
2663 115
1363 638
1875 793
1651 119
256 335
115 277
3362 115
262 427
4883 414
636 533
480 1381
1517 377
103 121
3921 115
69 80
373 109
4002 115
256 81
404 516
2384 562
97 120
4643 335
404 528
282 4980
2705 1436
306 119
111 277
420 1135
559 101
305 355
5522 3748
4858 578
115 2060
3243 112
3366 609
431 3981
285 263
257 260
261 110
346 327
311 107
309 121
3758 605
336 2690
115 266
506 115
641 1477
3332 821
570 109
407 755
2789 327
280 117
320 109
269 277
1587 4814
780 1034
282 386
3005 115
727 301
5383 412
291 463
559 109
111 280
285 485
3931 108
437 342
105 286
558 115
289 121
518 1747
269 813
292 104
282 319
259 314
100 296
472 4822
1766 301
604 360
4037 277
525 301
2400 301
78 527
2080 4097
1802 115
273 578
256 543
287 304
307 258
313 265
294 307
308 265
263 533
404 1401
485 402
4099 1827
780 4207
97 2253
922 924
735 1732
316 321
291 321
420 276
283 365
5507 72
1652 321
1033 412
340 110
118 488
507 97
3717 609
115 350
109 356
359 69
5574 5605
361 355
591 274
554 2159
365 103
336 368
276 368
279 461
1252 115
269 376
2562 276
257 377
391 3105
514 695
382 104
4357 2100
683 1437
262 384
478 301
277 386
2630 628
307 386
388 265
3215 321
391 281
392 297
393 115
2694 2040
4577 1385
862 110
610 5029
348 1129
281 402
5349 5638
361 402
282 2705
404 108
5269 3144
409 115
98 481
270 411
5150 1234
103 417
291 419
560 319
423 300
105 969
880 1040
875 321
5635 3003
4403 4352
112 1095
313 2512
287 516
285 588
601 112
538 376
975 578
460 115
283 669
282 625
571 368
346 481
489 443
2881 3125
479 533
1774 274
795 116
505 114
505 121
3326 482
514 378
1799 3105
100 523
301 523
273 1078
278 533
287 678
4053 301
1598 116
559 529
559 309
287 563
415 569
348 2513
448 577
2865 2935
2678 411
2681 1930
1304 1191
1321 3598
1074 102
980 360
373 595
612 118
955 319
295 2303
99 605
605 281
114 609
1334 1478
469 621
625 100
661 2368
1314 280
99 628
391 629
1792 3026
392 1975
315 1004
1169 115
269 735
362 664
1799 2930
1595 5234
1922 280
115 678
1027 301
1836 1494
3450 1926
4585 368
4309 1797
271 793
720 394
725 301
729 321
291 738
264 1097
4222 111
269 749
682 1650
779 399
5727 5737
780 300
785 301
2080 1455
790 528
448 2682
507 797
799 321
2792 276
283 801
273 1222
1212 338
808 702
544 809
109 814
819 495
1565 818
825 321
491 828
397 853
1362 115
869 337
893 121
493 903
4702 1559
405 1306
1244 2432
923 316
929 390
477 1016
953 100
690 1560
2981 3989
962 107
501 5648
114 997
1002 562
611 3140
391 1910
1728 427
283 1022
5759 969
2247 583
2874 466
1159 275
118 1063
313 2728
1536 301
1080 280
4454 4567
3121 115
3814 565
1121 312
5210 1227
615 4730
286 1137
257 1149
1150 100
1184 302
1213 107
1329 1800
1223 807
1231 109
2523 324
1380 274
1423 297
1433 301
4743 333
707 1686
3132 4839
289 1457
110 1614
1476 103
1491 443
1492 112
1811 924
4599 919
1575 301
494 1585
307 1600
1620 322
2160 108
1629 115
1782 368
4137 102
1820 702
1285 2007
372 4802
1908 479
3216 5203
362 2560
1978 590
3591 4186
294 2040
869 2071
2087 1455
2927 669
312 2606
3154 107
312 2229
102 3664
624 2324
4217 565
2340 368
388 2378
2400 115
2433 301
2822 274
4682 411
456 2510
287 2575
2524 360
2562 1998
2589 411
796 2608
2661 115
285 2705
365 2727
2793 402
2798 1515
392 2844
413 2875
2902 1902
5304 523
5341 389
611 3060
509 5488
2794 3138
262 3857
4704 2930
327 3298
3373 543
3381 116
1193 3401
3505 115
3539 321
3556 110
4987 327
3687 274
3703 669
2220 3738
2666 3804
391 3857
3864 280
4056 3670
550 4070
544 4172
3762 4232
4395 304
670 4346
2127 4584
4658 958
4713 1098
4714 1083
4736 569
538 4825
4831 1516
4843 281
5087 625
4920 645
2721 4921
551 5013
5899 3596
5046 2804
5677 5606
5313 1037
5322 3530
2187 5326
5464 265
5480 2680
1066 5491
5516 1903
5746 2635
1753 5809
437 443
416 345
65 71
1638 3289
1837 115
994 115
825 677
282 286
3337 115
271 820
312 758
1503 1467
391 694
382 317
305 2210
262 380
922 360
4294 321
351 116
544 67
116 97
262 335
431 378
100 321
294 361
980 4019
2718 565
1091 109
1400 115
3991 609
90 87
759 1099
1434 503
69 442
2493 301
883 3056
2854 645
114 1080
342 360
550 365
362 2291
1669 280
4382 105
119 100
564 567
321 1365
274 1478
639 385
2405 97
119 301
553 488
279 307
5413 578
796 1561
374 361
414 301
3688 115
79 84
1154 503
2274 797
311 118
1001 101
962 327
122 321
121 99
32 85
5257 5601
279 342
322 327
291 342
5556 583
99 346
84 77
2153 1037
903 1471
880 97
520 301
274 119
256 118
318 301
116 292
116 258
667 3897
403 3924
259 104
3571 115
112 286
2040 104
269 338
5280 625
1768 115
346 569
3244 830
636 115
114 270
1649 115
111 481
119 726
273 263
1677 384
1031 1574
1074 2571
256 5564
1811 121
1158 263
757 1725
269 507
1405 4190
84 627
365 330
2279 360
357 286
291 271
97 490
2739 924
4969 1945
293 110
917 103
1488 115
3925 3648
3378 1104
3472 5045
544 1011
629 301
103 298
923 277
6025 3104
1768 281
294 447
264 319
864 115
262 307
99 565
361 1144
66 435
580 6046
1177 296
2548 360
415 1581
315 276
305 110
477 2728
6053 1072
315 4338
265 319
660 314
2856 115
315 114
689 3035
322 115
269 316
1241 100
415 121
416 1675
3196 296
264 752
554 1156
5075 702
108 892
1537 2128
323 119
424 4318
276 327
257 828
562 1077
119 465
515 1107
283 335
265 453
291 338
269 342
427 638
3378 3155
2247 120
368 414
495 3743
291 379
117 1744
1021 361
271 412
1406 121
2649 301
357 267
270 3523
372 1325
2141 1866
401 1200
256 664
1565 111
2611 281
372 109
1919 381
4679 565
295 2265
374 265
3612 120
886 360
377 103
256 988
2519 115
362 1393
825 1900
5596 353
4719 4215
261 389
1488 321
256 1563
559 265
110 453
396 116
2408 1919
6063 368
5995 3142
277 397
4636 1841
6126 482
422 526
2127 1215
1228 1127
3948 301
865 5256
409 100
4950 3234
256 2130
269 410
540 307
413 327
475 360
416 383
5916 281
597 101
610 797
2989 3654
119 419
263 523
313 427
370 427
431 365
491 4844
848 4131
4336 1660
544 84
3222 115
598 263
624 4478
108 447
448 410
449 445
453 443
102 3500
551 380
1999 274
439 462
3054 5722
475 109
477 384
571 5772
98 1650
480 296
3151 563
291 1874
485 312
495 114
1392 5139
103 488
492 108
789 830
861 1028
277 3228
261 501
505 281
534 97
515 324
107 516
4697 578
2504 427
273 531
1423 444
641 863
658 3514
291 3301
260 876
551 356
735 298
559 97
563 342
1094 300
477 2438
569 112
407 574
509 577
279 577
256 903
32 625
273 1804
1021 376
1009 444
600 115
600 98
601 286
370 602
357 1227
5959 1191
3832 1083
5934 6027
1914 677
2281 115
614 321
778 4803
6038 6021
1915 578
2807 389
